<a href="abc">ddd</a>
# Batch processing - batch

```batch``` allows you to execute many a bounch of commands in one command. Actually, it is
a string processing program to generate commands you needed.

## Installation Instructions

You have to install [Python](https://www.python.org/) to get it work. The 
platform we have tested on is python 2.7.5, so we recommand that for you.

To install ```batch```, you just copy ```batch.py``` to any folder that in you 
```PATH``` enviroment variable.

## Basic Usage

The basic usage of ```batch``` is:

```batch [options] user_command```

`user_command`  include the actual commands  and the command within 
`batch`. A hello-world-example of  `batch` is:

```batch mkdir hello(#g 1 6)```

This command will make 5 folder names from ```hello1```, ```hello2```... to 
```hello5``` in current folder. `(#g 1 6)` is a function in `batch` which functions
like
```python
range(1, 6)
```
in python. It generates a list ranges from [1,6). Then 
Actually, the commands being executed by the system is a group:

    mkdir hello1 
    mkdir hello2
    mkdir hello3
    mkdir hello4
    mkdir hello5

There are two kinds of commands within ```batch``` which are:

 * **Variables**: All variables are begin `@` sign, _e.g._, `@1`,`@b1` etc. .The 
 variables include user-defined variables and built-in variable. All the 
 variables are generated
 by **Functions**.

 * **Functions**: The functions are in [s-expressions](https://en.wikipedia.org/wiki/S-expression).
The first arg in functions begin with `#`, like `#g` in the hello-world-example,
indicating which function it is. The following args is the parametes of the function.
**Some of the functions may define Variables**. Refer to [Function list](#fclist)
for more information.

## Options
* **-s**: just show commands other than execute it
* **-d**: debug mode, `batch` will show most infomation that helps you debug your commands
* **-p**: paralell execute mode, `batch` will execute the final command in parallel mode
## Variable List

## <a name="fclist"/></a>Function List
1. **`( )`**: The form of the function may seem to be very strange. Actually, this function just contac all the elements in the paratheses. The element may also be a list.
<div style="color:#CC0000"> **Note:**</div> 
+ The spaces between the elements is NOT ignored. 
+ The lists in the same pair of paratheses MUST be equal length.
> Example:
```python
 (a b c) => ['a',' b', ' c'], note the leading space of 2rd and 3th elements
 ((a)(b)(c)) => ['a','b','c']
 (a((d)(e))b) => ['adb','aeb']
 (a((1)(2))c((3)(4))) => ['a1c3','a2c4']
```

1. **`(#g lb ub [step])`** : Generate a list of numbers, from lower bound to upper bound (not included). `lb` and `ub` can be list (which must be equal length) which `#g` generate numbers in [`lb[0]`,`ub[0]`), [`lb[1]`,`ub[1]`)... `step` is an optional parameter, whose default value is 1.
<font color=#CC0000> **Note:**</font> the step parameter now is NOT implemented yet!
> Example:
```python
(#g 1 5) => ['1','2','3','4']
(#g 1 5 2) => ['1','3']
(#g (1 5) (3 8)) => ['1','2','5','6','7']
```

1. **`(#s varargs)`** : Execute system command and returns a list contains each line of the ouput of the command. varargs may be `string` or `list` or a composition of them. The spaces between them is not ignored.
> Example:
```python
(#s mkdir ((a)(b))) => ['mkdir a', 'mkdir b']
(#s cat(#g 1 3) (#g 1 3).txt) => ['cat1 1.txt', 'cat2 2.txt']
(#s mkdir a\(#g 1 3)\b)=>['mkdir a\1\b', 'mkdir a\2\b']
```

1. **`(#e varargs)`** : Evaluate a python expression. 
> Example:
```python
(#s mkdir ((a)(b))) => ['mkdir a', 'mkdir b']
(#s cat(#g 1 3) (#g 1 3).txt) => ['cat1 1.txt', 'cat2 2.txt']
(#s mkdir a\(#g 1 3)\b)=>['mkdir a\1\b', 'mkdir a\2\b']
```
## More Examples
In all examples, we just show the commands generated by `batch`.

1. `batch -s (#g 1 4)`  
> Output:
```
1
2
3
```

1. `batch -s (#m (#s cat a.txt)/abc(#g 1 4))`  
> The content in `a.txt`:
```
abc
def
```
> The output is :
```
abc/abc1
abc/abc2
abc/abc3
def/abc1
def/abc2
def/abc3
```

1. `batch -s (#e \"frame%05d-%3d.jpg\"%__[(#g 1 3),(#g 501 503)]__)`
> The output:
```
frame00001-501.jpg
frame00002-502.jpg
```

1. `batch -s convert (#pf .*\.\w+) -resize 10% resized-@b.@e`
> The files in current dir:
```
a.jpg
b.png
```
> The output:
```
convert a.jpg -resize 10% resized-a.jpg
convert b.png -resize 10% resized-b.png
```

1. Super long but real example (you had better copy the following code into an editor to see the matchness of the parentheses):
```
batch.py -s -d (#D try2 d)(#PS (#s (#PF @d\(#m (#pd @d .*)((\1)(&nbsn))) .*\.[pngjpegPNGJPEG]+) identify @f\@b.@e) __[\w+]__x__[\w+]__) convert wm.png -resize (#e \"%3.2f\"%__[min__[float__[@1]__,float__[@2]__]__/3543*100]__)% @f\wm@b.png ^&^& composite -gravity center @f\wm@b.png @f\@b.@e @f\@b.@e ^&^& del @f\wm@b.png
```

> The output:
```
convert a.jpg -resize 10% resized-a.jpg
convert b.png -resize 10% resized-b.png
```
convert wm.png -resize 5.28% try2\101000404\1\wm01.png && composite -gravity ce
nter try2\101000404\1\wm01.png try2\101000404\1\01.jpg try2\101000404\1\01.jpg &
& del try2\101000404\1\wm01.png
```

##Known issues:

1. When using `(#pf folder pt)`, there *MUST NOT* be a space at the end of `pt`, i.e. `pt `. Otherwise, this statement will not working.

##Todo List:
1. Add explorer add-on
